{
  "agent": "agent-a-paper-fetcher",
  "timestamp": "2025-11-17T09:04:15.982940",
  "status": "completed",
  "data": {
    "papers": [
      {
        "id": "2511.11571v1",
        "title": "Optimizing Mixture of Block Attention",
        "authors": [
          "Guangxuan Xiao",
          "Junxian Guo",
          "Kasra Mazaheri",
          "Song Han"
        ],
        "abstract": "Mixture of Block Attention (MoBA) (Lu et al., 2025) is a promising building block for efficiently processing long contexts in LLMs by enabling queries to sparsely attend to a small subset of key-value blocks, drastically reducing computational cost. However, the design principles governing MoBA's performance are poorly understood, and it lacks an efficient GPU implementation, hindering its practical adoption. In this paper, we first develop a statistical model to analyze MoBA's underlying mechan...",
        "published": "2025-11-14T18:59:59Z",
        "updated": "2025-11-14T18:59:59Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11571v1",
        "abs_url": "https://arxiv.org/abs/2511.11571v1",
        "categories": [
          "cs.LG",
          "cs.CL"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.11569v1",
        "title": "Private Frequency Estimation Via Residue Number Systems",
        "authors": [
          "Héber H. Arcolezi"
        ],
        "abstract": "We present \\textsf{ModularSubsetSelection} (MSS), a new algorithm for locally differentially private (LDP) frequency estimation. Given a universe of size $k$ and $n$ users, our $\\varepsilon$-LDP mechanism encodes each input via a Residue Number System (RNS) over $\\ell$ pairwise-coprime moduli $m_0, \\ldots, m_{\\ell-1}$, and reports a randomly chosen index $j \\in [\\ell]$ along with the perturbed residue using the statistically optimal \\textsf{SubsetSelection}~(SS) (Wang et al. 2016). This design r...",
        "published": "2025-11-14T18:58:41Z",
        "updated": "2025-11-14T18:58:41Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11569v1",
        "abs_url": "https://arxiv.org/abs/2511.11569v1",
        "categories": [
          "cs.CR",
          "cs.AI"
        ],
        "primary_category": "cs.CR"
      },
      {
        "id": "2511.11564v1",
        "title": "Estimating Total Effects in Bipartite Experiments with Spillovers and Partial Eligibility",
        "authors": [
          "Albert Tan",
          "Mohsen Bayati",
          "James Nordlund",
          "Roman Istomin"
        ],
        "abstract": "We study randomized experiments in bipartite systems where only a subset of treatment-side units are eligible for assignment while all units continue to interact, generating interference. We formalize eligibility-constrained bipartite experiments and define estimands aligned with full deployment: the Primary Total Treatment Effect (PTTE) on eligible units and the Secondary Total Treatment Effect (STTE) on ineligible units. Under randomization within the eligible set, we give identification condi...",
        "published": "2025-11-14T18:55:51Z",
        "updated": "2025-11-14T18:55:51Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11564v1",
        "abs_url": "https://arxiv.org/abs/2511.11564v1",
        "categories": [
          "stat.ME",
          "cs.LG",
          "stat.ML"
        ],
        "primary_category": "stat.ME"
      },
      {
        "id": "2511.11562v1",
        "title": "PRBench: Large-Scale Expert Rubrics for Evaluating High-Stakes Professional Reasoning",
        "authors": [
          "Afra Feyza Akyürek",
          "Advait Gosai",
          "Chen Bo Calvin Zhang",
          "Vipul Gupta",
          "Jaehwan Jeong"
        ],
        "abstract": "Frontier model progress is often measured by academic benchmarks, which offer a limited view of performance in real-world professional contexts. Existing evaluations often fail to assess open-ended, economically consequential tasks in high-stakes domains like Legal and Finance, where practical returns are paramount. To address this, we introduce Professional Reasoning Bench (PRBench), a realistic, open-ended, and difficult benchmark of real-world problems in Finance and Law. We open-source its 1...",
        "published": "2025-11-14T18:55:12Z",
        "updated": "2025-11-14T18:55:12Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11562v1",
        "abs_url": "https://arxiv.org/abs/2511.11562v1",
        "categories": [
          "cs.CL",
          "cs.CY"
        ],
        "primary_category": "cs.CL"
      },
      {
        "id": "2511.11560v1",
        "title": "A Unified Convergence Analysis for Semi-Decentralized Learning: Sampled-to-Sampled vs. Sampled-to-All Communication",
        "authors": [
          "Angelo Rodio",
          "Giovanni Neglia",
          "Zheng Chen",
          "Erik G. Larsson"
        ],
        "abstract": "In semi-decentralized federated learning, devices primarily rely on device-to-device communication but occasionally interact with a central server. Periodically, a sampled subset of devices uploads their local models to the server, which computes an aggregate model. The server can then either (i) share this aggregate model only with the sampled clients (sampled-to-sampled, S2S) or (ii) broadcast it to all clients (sampled-to-all, S2A). Despite their practical significance, a rigorous theoretical...",
        "published": "2025-11-14T18:53:37Z",
        "updated": "2025-11-14T18:53:37Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11560v1",
        "abs_url": "https://arxiv.org/abs/2511.11560v1",
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.DC"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.11558v1",
        "title": "Human-AI collaborative autonomous synthesis with pulsed laser deposition for remote epitaxy",
        "authors": [
          "Asraful Haque",
          "Daniel T. Yimam",
          "Jawad Chowdhury",
          "Ralph Bulanadi",
          "Ivan Vlassiouk"
        ],
        "abstract": "Autonomous laboratories typically rely on data-driven decision-making, occasionally with human-in-the-loop oversight to inject domain expertise. Fully leveraging AI agents, however, requires tightly coupled, collaborative workflows spanning hypothesis generation, experimental planning, execution, and interpretation. To address this, we develop and deploy a human-AI collaborative (HAIC) workflow that integrates large language models for hypothesis generation and analysis, with collaborative polic...",
        "published": "2025-11-14T18:48:52Z",
        "updated": "2025-11-14T18:48:52Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11558v1",
        "abs_url": "https://arxiv.org/abs/2511.11558v1",
        "categories": [
          "cond-mat.mtrl-sci",
          "cs.AI"
        ],
        "primary_category": "cond-mat.mtrl-sci"
      },
      {
        "id": "2511.11553v1",
        "title": "Multistability of Self-Attention Dynamics in Transformers",
        "authors": [
          "Claudio Altafini"
        ],
        "abstract": "In machine learning, a self-attention dynamics is a continuous-time multiagent-like model of the attention mechanisms of transformers. In this paper we show that such dynamics is related to a multiagent version of the Oja flow, a dynamical system that computes the principal eigenvector of a matrix corresponding for transformers to the value matrix. We classify the equilibria of the ``single-head'' self-attention system into four classes: consensus, bipartite consensus, clustering and polygonal e...",
        "published": "2025-11-14T18:45:22Z",
        "updated": "2025-11-14T18:45:22Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11553v1",
        "abs_url": "https://arxiv.org/abs/2511.11553v1",
        "categories": [
          "cs.LG",
          "eess.SY",
          "math.DS"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.11552v1",
        "title": "DocLens : A Tool-Augmented Multi-Agent Framework for Long Visual Document Understanding",
        "authors": [
          "Dawei Zhu",
          "Rui Meng",
          "Jiefeng Chen",
          "Sujian Li",
          "Tomas Pfister"
        ],
        "abstract": "Comprehending long visual documents, where information is distributed across extensive pages of text and visual elements, is a critical but challenging task for modern Vision-Language Models (VLMs). Existing approaches falter on a fundamental challenge: evidence localization. They struggle to retrieve relevant pages and overlook fine-grained details within visual elements, leading to limited performance and model hallucination. To address this, we propose DocLens, a tool-augmented multi-agent fr...",
        "published": "2025-11-14T18:42:18Z",
        "updated": "2025-11-14T18:42:18Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11552v1",
        "abs_url": "https://arxiv.org/abs/2511.11552v1",
        "categories": [
          "cs.CV",
          "cs.CL"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2511.11551v1",
        "title": "Aligning Machiavellian Agents: Behavior Steering via Test-Time Policy Shaping",
        "authors": [
          "Dena Mujtaba",
          "Brian Hu",
          "Anthony Hoogs",
          "Arslan Basharat"
        ],
        "abstract": "The deployment of decision-making AI agents presents a critical challenge in maintaining alignment with human values or guidelines while operating in complex, dynamic environments. Agents trained solely to achieve their objectives may adopt harmful behavior, exposing a key trade-off between maximizing the reward function and maintaining the alignment. For the pre-trained agents, ensuring alignment is particularly challenging, as retraining can be a costly and slow process. This is further compli...",
        "published": "2025-11-14T18:42:18Z",
        "updated": "2025-11-14T18:42:18Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11551v1",
        "abs_url": "https://arxiv.org/abs/2511.11551v1",
        "categories": [
          "cs.AI",
          "cs.CL"
        ],
        "primary_category": "cs.AI"
      },
      {
        "id": "2511.11539v1",
        "title": "Generalizing Fair Clustering to Multiple Groups: Algorithms and Applications",
        "authors": [
          "Diptarka Chakraborty",
          "Kushagra Chatterjee",
          "Debarati Das",
          "Tien-Long Nguyen"
        ],
        "abstract": "Clustering is a fundamental task in machine learning and data analysis, but it frequently fails to provide fair representation for various marginalized communities defined by multiple protected attributes -- a shortcoming often caused by biases in the training data. As a result, there is a growing need to enhance the fairness of clustering outcomes, ideally by making minimal modifications, possibly as a post-processing step after conventional clustering. Recently, Chakraborty et al. [COLT'25] in...",
        "published": "2025-11-14T18:19:18Z",
        "updated": "2025-11-14T18:19:18Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11539v1",
        "abs_url": "https://arxiv.org/abs/2511.11539v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.11533v1",
        "title": "Volumetric Ergodic Control",
        "authors": [
          "Jueun Kwon",
          "Max M. Sun",
          "Todd Murphey"
        ],
        "abstract": "Ergodic control synthesizes optimal coverage behaviors over spatial distributions for nonlinear systems. However, existing formulations model the robot as a non-volumetric point, but in practice a robot interacts with the environment through its body and sensors with physical volume. In this work, we introduce a new ergodic control formulation that optimizes spatial coverage using a volumetric state representation. Our method preserves the asymptotic coverage guarantees of ergodic control, adds ...",
        "published": "2025-11-14T18:10:40Z",
        "updated": "2025-11-14T18:10:40Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11533v1",
        "abs_url": "https://arxiv.org/abs/2511.11533v1",
        "categories": [
          "cs.RO",
          "cs.AI"
        ],
        "primary_category": "cs.RO"
      },
      {
        "id": "2511.11522v1",
        "title": "CVChess: A Deep Learning Framework for Converting Chessboard Images to Forsyth-Edwards Notation",
        "authors": [
          "Luthira Abeykoon",
          "Ved Patel",
          "Gawthaman Senthilvelan",
          "Darshan Kasundra"
        ],
        "abstract": "Chess has experienced a large increase in viewership since the pandemic, driven largely by the accessibility of online learning platforms. However, no equivalent assistance exists for physical chess games, creating a divide between analog and digital chess experiences. This paper presents CVChess, a deep learning framework for converting chessboard images to Forsyth-Edwards Notation (FEN), which is later input into online chess engines to provide you with the best next move. Our approach employs...",
        "published": "2025-11-14T17:50:35Z",
        "updated": "2025-11-14T17:50:35Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11522v1",
        "abs_url": "https://arxiv.org/abs/2511.11522v1",
        "categories": [
          "cs.CV",
          "cs.LG"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2511.11519v1",
        "title": "Experience-Guided Adaptation of Inference-Time Reasoning Strategies",
        "authors": [
          "Adam Stein",
          "Matthew Trager",
          "Benjamin Bowman",
          "Michael Kleinman",
          "Aditya Chattopadhyay"
        ],
        "abstract": "Enabling agentic AI systems to adapt their problem-solving approaches based on post-training interactions remains a fundamental challenge. While systems that update and maintain a memory at inference time have been proposed, existing designs only steer the system by modifying textual input to a language model or agent, which means that they cannot change sampling parameters, remove tools, modify system prompts, or switch between agentic and workflow paradigms. On the other hand, systems that ada...",
        "published": "2025-11-14T17:45:28Z",
        "updated": "2025-11-14T17:45:28Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11519v1",
        "abs_url": "https://arxiv.org/abs/2511.11519v1",
        "categories": [
          "cs.AI",
          "cs.LG"
        ],
        "primary_category": "cs.AI"
      },
      {
        "id": "2511.11518v1",
        "title": "W2S-AlignTree: Weak-to-Strong Inference-Time Alignment for Large Language Models via Monte Carlo Tree Search",
        "authors": [
          "Zhenyu Ding",
          "Yuhao Wang",
          "Tengyue Xiao",
          "Haoying Wang",
          "Guojun Ma"
        ],
        "abstract": "Large Language Models (LLMs) demonstrate impressive capabilities, yet their outputs often suffer from misalignment with human preferences due to the inadequacy of weak supervision and a lack of fine-grained control. Training-time alignment methods like Reinforcement Learning from Human Feedback (RLHF) face prohibitive costs in expert supervision and inherent scalability limitations, offering limited dynamic control during inference. Consequently, there is an urgent need for scalable and adaptabl...",
        "published": "2025-11-14T17:42:02Z",
        "updated": "2025-11-14T17:42:02Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11518v1",
        "abs_url": "https://arxiv.org/abs/2511.11518v1",
        "categories": [
          "cs.CL"
        ],
        "primary_category": "cs.CL"
      },
      {
        "id": "2511.11505v1",
        "title": "FarSkip-Collective: Unhobbling Blocking Communication in Mixture of Experts Models",
        "authors": [
          "Yonatan Dukler",
          "Guihong Li",
          "Deval Shah",
          "Vikram Appia",
          "Emad Barsoum"
        ],
        "abstract": "Blocking communication presents a major hurdle in running MoEs efficiently in distributed settings. To address this, we present FarSkip-Collective which modifies the architecture of modern models to enable overlapping of their computation with communication. Our approach modifies the architecture to skip connections in the model and it is unclear a priori whether the modified model architecture can remain as capable, especially for large state-of-the-art models and while modifying all of the mod...",
        "published": "2025-11-14T17:25:14Z",
        "updated": "2025-11-14T17:25:14Z",
        "pdf_url": "https://arxiv.org/pdf/2511.11505v1",
        "abs_url": "https://arxiv.org/abs/2511.11505v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      }
    ],
    "count": 15,
    "categories": [
      "cs.AI",
      "cs.LG",
      "cs.CL"
    ],
    "fetch_date": "2025-11-17"
  },
  "metadata": {
    "source": "arXiv API",
    "query": "cat:cs.AI OR cat:cs.LG OR cat:cs.CL",
    "deduplication": {
      "total_fetched": 15,
      "new_papers": 15,
      "duplicates_filtered": 0,
      "last_fetch": "2025-11-16T09:02:52.167185"
    }
  },
  "costs": {
    "execution_time": 0.5519020557403564,
    "execution_minutes": 0.009198367595672607,
    "github_actions": 7.358694076538086e-05,
    "openai": {
      "input": 0,
      "output": 0,
      "total": 0
    },
    "total": 7.358694076538086e-05,
    "token_usage": {}
  }
}