{
  "agent": "agent-a-paper-fetcher",
  "timestamp": "2025-12-11T09:05:08.733134",
  "status": "completed",
  "data": {
    "papers": [
      {
        "id": "2512.09929v1",
        "title": "Closing the Train-Test Gap in World Models for Gradient-Based Planning",
        "authors": [
          "Arjun Parthasarathy",
          "Nimit Kalra",
          "Rohun Agrawal",
          "Yann LeCun",
          "Oumayma Bounou"
        ],
        "abstract": "World models paired with model predictive control (MPC) can be trained offline on large-scale datasets of expert trajectories and enable generalization to a wide range of planning tasks at inference time. Compared to traditional MPC procedures, which rely on slow search algorithms or on iteratively solving optimization problems exactly, gradient-based planning offers a computationally efficient alternative. However, the performance of gradient-based planning has thus far lagged behind that of ot...",
        "published": "2025-12-10T18:59:45Z",
        "updated": "2025-12-10T18:59:45Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09929v1",
        "abs_url": "https://arxiv.org/abs/2512.09929v1",
        "categories": [
          "cs.LG",
          "cs.RO"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.09920v1",
        "title": "LISN: Language-Instructed Social Navigation with VLM-based Controller Modulating",
        "authors": [
          "Junting Chen",
          "Yunchuan Li",
          "Panfeng Jiang",
          "Jiacheng Du",
          "Zixuan Chen"
        ],
        "abstract": "Towards human-robot coexistence, socially aware navigation is significant for mobile robots. Yet existing studies on this area focus mainly on path efficiency and pedestrian collision avoidance, which are essential but represent only a fraction of social navigation. Beyond these basics, robots must also comply with user instructions, aligning their actions to task goals and social norms expressed by humans. In this work, we present LISN-Bench, the first simulation-based benchmark for language-in...",
        "published": "2025-12-10T18:54:30Z",
        "updated": "2025-12-10T18:54:30Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09920v1",
        "abs_url": "https://arxiv.org/abs/2512.09920v1",
        "categories": [
          "cs.RO",
          "cs.AI",
          "cs.CV"
        ],
        "primary_category": "cs.RO"
      },
      {
        "id": "2512.09914v1",
        "title": "FALCON: Few-step Accurate Likelihoods for Continuous Flows",
        "authors": [
          "Danyal Rehman",
          "Tara Akhound-Sadegh",
          "Artem Gazizov",
          "Yoshua Bengio",
          "Alexander Tong"
        ],
        "abstract": "Scalable sampling of molecular states in thermodynamic equilibrium is a long-standing challenge in statistical physics. Boltzmann Generators tackle this problem by pairing a generative model, capable of exact likelihood computation, with importance sampling to obtain consistent samples under the target distribution. Current Boltzmann Generators primarily use continuous normalizing flows (CNFs) trained with flow matching for efficient training of powerful models. However, likelihood calculation f...",
        "published": "2025-12-10T18:47:25Z",
        "updated": "2025-12-10T18:47:25Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09914v1",
        "abs_url": "https://arxiv.org/abs/2512.09914v1",
        "categories": [
          "cs.LG",
          "cs.AI"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.09912v1",
        "title": "Supervised learning pays attention",
        "authors": [
          "Erin Craig",
          "Robert Tibshirani"
        ],
        "abstract": "In-context learning with attention enables large neural networks to make context-specific predictions by selectively focusing on relevant examples. Here, we adapt this idea to supervised learning procedures such as lasso regression and gradient boosting, for tabular data. Our goals are to (1) flexibly fit personalized models for each prediction point and (2) retain model simplicity and interpretability.\n  Our method fits a local model for each test observation by weighting the training data acco...",
        "published": "2025-12-10T18:43:46Z",
        "updated": "2025-12-10T18:43:46Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09912v1",
        "abs_url": "https://arxiv.org/abs/2512.09912v1",
        "categories": [
          "stat.ML",
          "cs.AI",
          "cs.LG"
        ],
        "primary_category": "stat.ML"
      },
      {
        "id": "2512.09910v1",
        "title": "Efficient Continual Learning in Neural Machine Translation: A Low-Rank Adaptation Approach",
        "authors": [
          "Salvador Carrión",
          "Francisco Casacuberta"
        ],
        "abstract": "Continual learning in Neural Machine Translation (NMT) faces the dual challenges of catastrophic forgetting and the high computational cost of retraining. This study establishes Low-Rank Adaptation (LoRA) as a parameter-efficient framework to address these challenges in dedicated NMT architectures. We first demonstrate that LoRA-based fine-tuning adapts NMT models to new languages and domains with performance on par with full-parameter techniques, while utilizing only a fraction of the parameter...",
        "published": "2025-12-10T18:37:57Z",
        "updated": "2025-12-10T18:37:57Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09910v1",
        "abs_url": "https://arxiv.org/abs/2512.09910v1",
        "categories": [
          "cs.CL",
          "cs.AI"
        ],
        "primary_category": "cs.CL"
      },
      {
        "id": "2512.09909v1",
        "title": "STACHE: Local Black-Box Explanations for Reinforcement Learning Policies",
        "authors": [
          "Andrew Elashkin",
          "Orna Grumberg"
        ],
        "abstract": "Reinforcement learning agents often behave unexpectedly in sparse-reward or safety-critical environments, creating a strong need for reliable debugging and verification tools. In this paper, we propose STACHE, a comprehensive framework for generating local, black-box explanations for an agent's specific action within discrete Markov games. Our method produces a Composite Explanation consisting of two complementary components: (1) a Robustness Region, the connected neighborhood of states where th...",
        "published": "2025-12-10T18:37:28Z",
        "updated": "2025-12-10T18:37:28Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09909v1",
        "abs_url": "https://arxiv.org/abs/2512.09909v1",
        "categories": [
          "cs.LG",
          "cs.AI"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.09908v1",
        "title": "Bayesian Networks, Markov Networks, Moralisation, Triangulation: a Categorical Perspective",
        "authors": [
          "Antonio Lorenzin",
          "Fabio Zanasi"
        ],
        "abstract": "Moralisation and Triangulation are transformations allowing to switch between different ways of factoring a probability distribution into a graphical model. Moralisation allows to view a Bayesian network (a directed model) as a Markov network (an undirected model), whereas triangulation addresses the opposite direction. We present a categorical framework where these transformations are modelled as functors between a category of Bayesian networks and one of Markov networks. The two kinds of netwo...",
        "published": "2025-12-10T18:36:30Z",
        "updated": "2025-12-10T18:36:30Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09908v1",
        "abs_url": "https://arxiv.org/abs/2512.09908v1",
        "categories": [
          "cs.AI",
          "cs.LO",
          "math.CT"
        ],
        "primary_category": "cs.AI"
      },
      {
        "id": "2512.09898v1",
        "title": "Visual Heading Prediction for Autonomous Aerial Vehicles",
        "authors": [
          "Reza Ahmari",
          "Ahmad Mohammadi",
          "Vahid Hemmati",
          "Mohammed Mynuddin",
          "Parham Kebria"
        ],
        "abstract": "The integration of Unmanned Aerial Vehicles (UAVs) and Unmanned Ground Vehicles (UGVs) is increasingly central to the development of intelligent autonomous systems for applications such as search and rescue, environmental monitoring, and logistics. However, precise coordination between these platforms in real-time scenarios presents major challenges, particularly when external localization infrastructure such as GPS or GNSS is unavailable or degraded [1]. This paper proposes a vision-based, data...",
        "published": "2025-12-10T18:27:37Z",
        "updated": "2025-12-10T18:27:37Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09898v1",
        "abs_url": "https://arxiv.org/abs/2512.09898v1",
        "categories": [
          "cs.RO",
          "cs.AI",
          "cs.CV",
          "cs.MA",
          "eess.SY"
        ],
        "primary_category": "cs.RO"
      },
      {
        "id": "2512.09897v1",
        "title": "SCOPE: Language Models as One-Time Teacher for Hierarchical Planning in Text Environments",
        "authors": [
          "Haoye Lu",
          "Pavan Seshadri",
          "Kaheer Suleman"
        ],
        "abstract": "Long-term planning in complex, text-based environments presents significant challenges due to open-ended action spaces, ambiguous observations, and sparse feedback. Recent research suggests that large language models (LLMs) encode rich semantic knowledge about the world, which can be valuable for guiding agents in high-level reasoning and planning across both embodied and purely textual settings. However, existing approaches often depend heavily on querying LLMs during training and inference, ma...",
        "published": "2025-12-10T18:26:14Z",
        "updated": "2025-12-10T18:26:14Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09897v1",
        "abs_url": "https://arxiv.org/abs/2512.09897v1",
        "categories": [
          "cs.AI",
          "cs.CL"
        ],
        "primary_category": "cs.AI"
      },
      {
        "id": "2512.09895v1",
        "title": "Human-in-the-Loop and AI: Crowdsourcing Metadata Vocabulary for Materials Science",
        "authors": [
          "Jane Greenberg",
          "Scott McClellan",
          "Addy Ireland",
          "Robert Sammarco",
          "Colton Gerber"
        ],
        "abstract": "Metadata vocabularies are essential for advancing FAIR and FARR data principles, but their development constrained by limited human resources and inconsistent standardization practices. This paper introduces MatSci-YAMZ, a platform that integrates artificial intelligence (AI) and human-in-the-loop (HILT), including crowdsourcing, to support metadata vocabulary development. The paper reports on a proof-of-concept use case evaluating the AI-HILT model in materials science, a highly interdisciplina...",
        "published": "2025-12-10T18:22:57Z",
        "updated": "2025-12-10T18:22:57Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09895v1",
        "abs_url": "https://arxiv.org/abs/2512.09895v1",
        "categories": [
          "cs.AI",
          "cs.DL"
        ],
        "primary_category": "cs.AI"
      },
      {
        "id": "2512.09894v1",
        "title": "Exploring Protein Language Model Architecture-Induced Biases for Antibody Comprehension",
        "authors": [
          " Mengren",
          " Liu",
          "Yixiang Zhang",
          " Yiming",
          " Zhang"
        ],
        "abstract": "Recent advances in protein language models (PLMs) have demonstrated remarkable capabilities in understanding protein sequences. However, the extent to which different model architectures capture antibody-specific biological properties remains unexplored. In this work, we systematically investigate how architectural choices in PLMs influence their ability to comprehend antibody sequence characteristics and functions. We evaluate three state-of-the-art PLMs-AntiBERTa, BioBERT, and ESM2--against a ...",
        "published": "2025-12-10T18:22:51Z",
        "updated": "2025-12-10T18:22:51Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09894v1",
        "abs_url": "https://arxiv.org/abs/2512.09894v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.09892v1",
        "title": "Provably Learning from Modern Language Models via Low Logit Rank",
        "authors": [
          "Noah Golowich",
          "Allen Liu",
          "Abhishek Shetty"
        ],
        "abstract": "While modern language models and their inner workings are incredibly complex, recent work (Golowich, Liu & Shetty; 2025) has proposed a simple and potentially tractable abstraction for them through the observation that empirically, these language models all seem to have approximately low logit rank. Roughly, this means that a matrix formed by the model's log probabilities of various tokens conditioned on certain sequences of tokens is well approximated by a low rank matrix.\n  In this paper, our ...",
        "published": "2025-12-10T18:18:11Z",
        "updated": "2025-12-10T18:18:11Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09892v1",
        "abs_url": "https://arxiv.org/abs/2512.09892v1",
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.DS",
          "stat.ML"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.09890v1",
        "title": "Analysis of Dirichlet Energies as Over-smoothing Measures",
        "authors": [
          "Anna Bison",
          "Alessandro Sperduti"
        ],
        "abstract": "We analyze the distinctions between two functionals often used as over-smoothing measures: the Dirichlet energies induced by the unnormalized graph Laplacian and the normalized graph Laplacian. We demonstrate that the latter fails to satisfy the axiomatic definition of a node-similarity measure proposed by Rusch \\textit{et al.} By formalizing fundamental spectral properties of these two definitions, we highlight critical distinctions necessary to select the metric that is spectrally compatible w...",
        "published": "2025-12-10T18:17:33Z",
        "updated": "2025-12-10T18:17:33Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09890v1",
        "abs_url": "https://arxiv.org/abs/2512.09890v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.09886v1",
        "title": "HPM-KD: Hierarchical Progressive Multi-Teacher Framework for Knowledge Distillation and Efficient Model Compression",
        "authors": [
          "Gustavo Coelho Haase",
          "Paulo Henrique Dourado da Silva"
        ],
        "abstract": "Knowledge Distillation (KD) has emerged as a promising technique for model compression but faces critical limitations: (1) sensitivity to hyperparameters requiring extensive manual tuning, (2) capacity gap when distilling from very large teachers to small students, (3) suboptimal coordination in multi-teacher scenarios, and (4) inefficient use of computational resources. We present \\textbf{HPM-KD}, a framework that integrates six synergistic components: (i) Adaptive Configuration Manager via met...",
        "published": "2025-12-10T18:15:15Z",
        "updated": "2025-12-10T18:15:15Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09886v1",
        "abs_url": "https://arxiv.org/abs/2512.09886v1",
        "categories": [
          "cs.LG",
          "stat.AP"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.09882v1",
        "title": "Comparing AI Agents to Cybersecurity Professionals in Real-World Penetration Testing",
        "authors": [
          "Justin W. Lin",
          "Eliot Krzysztof Jones",
          "Donovan Julian Jasper",
          "Ethan Jun-shen Ho",
          "Anna Wu"
        ],
        "abstract": "We present the first comprehensive evaluation of AI agents against human cybersecurity professionals in a live enterprise environment. We evaluate ten cybersecurity professionals alongside six existing AI agents and ARTEMIS, our new agent scaffold, on a large university network consisting of ~8,000 hosts across 12 subnets. ARTEMIS is a multi-agent framework featuring dynamic prompt generation, arbitrary sub-agents, and automatic vulnerability triaging. In our comparative study, ARTEMIS placed se...",
        "published": "2025-12-10T18:12:29Z",
        "updated": "2025-12-10T18:12:29Z",
        "pdf_url": "https://arxiv.org/pdf/2512.09882v1",
        "abs_url": "https://arxiv.org/abs/2512.09882v1",
        "categories": [
          "cs.AI",
          "cs.CR",
          "cs.CY"
        ],
        "primary_category": "cs.AI"
      }
    ],
    "count": 15,
    "categories": [
      "cs.AI",
      "cs.LG",
      "cs.CL"
    ],
    "fetch_date": "2025-12-11"
  },
  "metadata": {
    "source": "arXiv API",
    "query": "cat:cs.AI OR cat:cs.LG OR cat:cs.CL",
    "deduplication": {
      "total_fetched": 15,
      "new_papers": 15,
      "duplicates_filtered": 0,
      "last_fetch": "2025-12-10T09:04:57.135514"
    }
  },
  "costs": {
    "execution_time": 0.52516770362854,
    "execution_minutes": 0.008752795060475667,
    "github_actions": 7.002236048380534e-05,
    "openai": {
      "input": 0,
      "output": 0,
      "total": 0
    },
    "total": 7.002236048380534e-05,
    "token_usage": {}
  }
}