{
  "agent": "agent-a-paper-fetcher",
  "timestamp": "2025-12-04T09:04:52.243912",
  "status": "completed",
  "data": {
    "papers": [
      {
        "id": "2512.04072v1",
        "title": "SkillFactory: Self-Distillation For Learning Cognitive Behaviors",
        "authors": [
          "Zayne Sprague",
          "Jack Lu",
          "Manya Wadhwa",
          "Sedrick Keh",
          "Mengye Ren"
        ],
        "abstract": "Reasoning models leveraging long chains of thought employ various cognitive skills, such as verification of their answers, backtracking, retrying by an alternate method, and more. Previous work has shown that when a base language model exhibits these skills, training that model further with reinforcement learning (RL) can learn to leverage them. How can we get models to leverage skills that aren't exhibited by base models? Our work, SkillFactory, is a method for fine-tuning models to roughly lea...",
        "published": "2025-12-03T18:54:53Z",
        "updated": "2025-12-03T18:54:53Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04072v1",
        "abs_url": "https://arxiv.org/abs/2512.04072v1",
        "categories": [
          "cs.CL",
          "cs.AI"
        ],
        "primary_category": "cs.CL"
      },
      {
        "id": "2512.04068v1",
        "title": "Learning Steerable Clarification Policies with Collaborative Self-play",
        "authors": [
          "Jonathan Berant",
          "Maximillian Chen",
          "Adam Fisch",
          "Reza Aghajani",
          "Fantine Huot"
        ],
        "abstract": "To handle underspecified or ambiguous queries, AI assistants need a policy for managing their uncertainty to determine (a) when to guess the user intent and answer directly, (b) when to enumerate and answer multiple possible intents, and (c) when to ask a clarifying question. However, such policies are contextually dependent on factors such as user preferences or modality. For example, enumerating multiple possible user intentions is cumbersome on small screens or in a voice setting. In this wor...",
        "published": "2025-12-03T18:49:54Z",
        "updated": "2025-12-03T18:49:54Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04068v1",
        "abs_url": "https://arxiv.org/abs/2512.04068v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.04065v1",
        "title": "Fare Comparison App of Uber, Ola and Rapido",
        "authors": [
          "Ashlesha Gopinath Sawant",
          "Sahil S. Jadhav",
          "Vidhan R. Jain",
          "Shriraj S. Jagtap",
          "Prachi Jadhav"
        ],
        "abstract": "In todays increasing world, it is very important to have good hailing services like Ola, Uber, and Rapido as it is very essential for our daily transportation. Users often face difficulties in choosing the most appropriate and efficient ride that would lead to both cost-effective and would take us to our destination in less time. This project provides you with the web application that helps you to select the most beneficial ride for you by providing users with the fare comparison between Ola, Ub...",
        "published": "2025-12-03T18:48:33Z",
        "updated": "2025-12-03T18:48:33Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04065v1",
        "abs_url": "https://arxiv.org/abs/2512.04065v1",
        "categories": [
          "cs.LG",
          "cs.AI"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.04062v1",
        "title": "Eval Factsheets: A Structured Framework for Documenting AI Evaluations",
        "authors": [
          "Florian Bordes",
          "Candace Ross",
          "Justine T Kao",
          "Evangelia Spiliopoulou",
          "Adina Williams"
        ],
        "abstract": "The rapid proliferation of benchmarks has created significant challenges in reproducibility, transparency, and informed decision-making. However, unlike datasets and models -- which benefit from structured documentation frameworks like Datasheets and Model Cards -- evaluation methodologies lack systematic documentation standards. We introduce Eval Factsheets, a structured, descriptive framework for documenting AI system evaluations through a comprehensive taxonomy and questionnaire-based approac...",
        "published": "2025-12-03T18:46:50Z",
        "updated": "2025-12-03T18:46:50Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04062v1",
        "abs_url": "https://arxiv.org/abs/2512.04062v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.04058v1",
        "title": "Closing the problem of which causal structures of up to six total nodes have a classical-quantum gap",
        "authors": [
          "Shashaank Khanna",
          "Matthew Pusey",
          "Roger Colbeck"
        ],
        "abstract": "The discovery of Bell that there exist quantum correlations that cannot be reproduced classically is one of the most important in the foundations of quantum mechanics, as well as having practical implications. Bell's result was originally proven in a simple bipartite causal structure, but analogous results have also been shown in further causal structures. Here we study the only causal structure with six or fewer nodes in which the question of whether or not there exist quantum correlations that...",
        "published": "2025-12-03T18:44:25Z",
        "updated": "2025-12-03T18:44:25Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04058v1",
        "abs_url": "https://arxiv.org/abs/2512.04058v1",
        "categories": [
          "quant-ph",
          "cs.LG",
          "math.ST"
        ],
        "primary_category": "quant-ph"
      },
      {
        "id": "2512.04051v1",
        "title": "Convergence for Discrete Parameter Updates",
        "authors": [
          "Paul Wilson",
          "Fabio Zanasi",
          "George Constantinides"
        ],
        "abstract": "Modern deep learning models require immense computational resources, motivating research into low-precision training. Quantised training addresses this by representing training components in low-bit integers, but typically relies on discretising real-valued updates. We introduce an alternative approach where the update rule itself is discrete, avoiding the quantisation of continuous updates by design. We establish convergence guarantees for a general class of such discrete schemes, and present a...",
        "published": "2025-12-03T18:34:26Z",
        "updated": "2025-12-03T18:34:26Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04051v1",
        "abs_url": "https://arxiv.org/abs/2512.04051v1",
        "categories": [
          "cs.LG",
          "math.OC"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.04048v1",
        "title": "Stable Signer: Hierarchical Sign Language Generative Model",
        "authors": [
          "Sen Fang",
          "Yalin Feng",
          "Hongbin Zhong",
          "Yanxin Zhang",
          "Dimitris N. Metaxas"
        ],
        "abstract": "Sign Language Production (SLP) is the process of converting the complex input text into a real video. Most previous works focused on the Text2Gloss, Gloss2Pose, Pose2Vid stages, and some concentrated on Prompt2Gloss and Text2Avatar stages. However, this field has made slow progress due to the inaccuracy of text conversion, pose generation, and the rendering of poses into real human videos in these stages, resulting in gradually accumulating errors. Therefore, in this paper, we streamline the tra...",
        "published": "2025-12-03T18:33:40Z",
        "updated": "2025-12-03T18:33:40Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04048v1",
        "abs_url": "https://arxiv.org/abs/2512.04048v1",
        "categories": [
          "cs.CV",
          "cs.CL",
          "cs.CY"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2512.04047v1",
        "title": "Polarization by Design: How Elites Could Shape Mass Preferences as AI Reduces Persuasion Costs",
        "authors": [
          "Nadav Kunievsky"
        ],
        "abstract": "In democracies, major policy decisions typically require some form of majority or consensus, so elites must secure mass support to govern. Historically, elites could shape support only through limited instruments like schooling and mass media; advances in AI-driven persuasion sharply reduce the cost and increase the precision of shaping public opinion, making the distribution of preferences itself an object of deliberate design. We develop a dynamic model in which elites choose how much to resha...",
        "published": "2025-12-03T18:33:26Z",
        "updated": "2025-12-03T18:33:26Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04047v1",
        "abs_url": "https://arxiv.org/abs/2512.04047v1",
        "categories": [
          "econ.GN",
          "cs.AI",
          "cs.CY"
        ],
        "primary_category": "econ.GN"
      },
      {
        "id": "2512.04044v1",
        "title": "MarkTune: Improving the Quality-Detectability Trade-off in Open-Weight LLM Watermarking",
        "authors": [
          "Yizhou Zhao",
          "Zhiwei Steven Wu",
          "Adam Block"
        ],
        "abstract": "Watermarking aims to embed hidden signals in generated text that can be reliably detected when given access to a secret key. Open-weight language models pose acute challenges for such watermarking schemes because the inference-time interventions that dominate contemporary approaches cannot be enforced once model weights are public. Existing watermaking techniques for open-weight models, such as the recently proposed GaussMark, typically rely on small modifications to model weights, which can yie...",
        "published": "2025-12-03T18:32:19Z",
        "updated": "2025-12-03T18:32:19Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04044v1",
        "abs_url": "https://arxiv.org/abs/2512.04044v1",
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.CR"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.04039v1",
        "title": "Fast & Efficient Normalizing Flows and Applications of Image Generative Models",
        "authors": [
          "Sandeep Nagar"
        ],
        "abstract": "This thesis presents novel contributions in two primary areas: advancing the efficiency of generative models, particularly normalizing flows, and applying generative models to solve real-world computer vision challenges. The first part introduce significant improvements to normalizing flow architectures through six key innovations: 1) Development of invertible 3x3 Convolution layers with mathematically proven necessary and sufficient conditions for invertibility, (2) introduction of a more effic...",
        "published": "2025-12-03T18:29:03Z",
        "updated": "2025-12-03T18:29:03Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04039v1",
        "abs_url": "https://arxiv.org/abs/2512.04039v1",
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2512.04034v1",
        "title": "Domain Feature Collapse: Implications for Out-of-Distribution Detection and Solutions",
        "authors": [
          "Hong Yang",
          "Devroop Kar",
          "Qi Yu",
          "Alex Ororbia",
          "Travis Desell"
        ],
        "abstract": "Why do state-of-the-art OOD detection methods exhibit catastrophic failure when models are trained on single-domain datasets? We provide the first theoretical explanation for this phenomenon through the lens of information theory. We prove that supervised learning on single-domain data inevitably produces domain feature collapse -- representations where I(x_d; z) = 0, meaning domain-specific information is completely discarded. This is a fundamental consequence of information bottleneck optimiza...",
        "published": "2025-12-03T18:17:49Z",
        "updated": "2025-12-03T18:17:49Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04034v1",
        "abs_url": "https://arxiv.org/abs/2512.04034v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2512.04032v1",
        "title": "Jina-VLM: Small Multilingual Vision Language Model",
        "authors": [
          "Andreas Koukounas",
          "Georgios Mastrapas",
          "Florian Hönicke",
          "Sedigheh Eslami",
          "Guillaume Roncari"
        ],
        "abstract": "We present Jina-VLM, a 2.4B parameter vision-language model that achieves state-of-the-art multilingual visual question answering among open 2B-scale VLMs. The model couples a SigLIP2 vision encoder with a Qwen3 language backbone through an attention-pooling connector that enables token-efficient processing of arbitrary-resolution images. Across standard VQA benchmarks and multilingual evaluations, Jina-VLM outperforms comparable models while preserving competitive text-only performance....",
        "published": "2025-12-03T18:13:41Z",
        "updated": "2025-12-03T18:13:41Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04032v1",
        "abs_url": "https://arxiv.org/abs/2512.04032v1",
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.CV"
        ],
        "primary_category": "cs.CL"
      },
      {
        "id": "2512.04031v1",
        "title": "Large Language Models for Limited Noisy Data: A Gravitational Wave Identification Study",
        "authors": [
          "Yixuan Li",
          "Yuhao Lu",
          "Yang Liu",
          "Liang Li",
          "R. Ruffini"
        ],
        "abstract": "This work investigates whether large language models (LLMs) offer advantages over traditional neural networks for astronomical data processing, in regimes with non-Gaussian, non-stationary noise and limited labeled samples. Gravitational wave observations provide an suitable test case, using only 90 LIGO events, finetuned LLMs achieve 97.4\\% accuracy for identifying signals. Further experiments show that, in contrast to traditional networks that rely on large simulated datasets, additional simul...",
        "published": "2025-12-03T18:13:01Z",
        "updated": "2025-12-03T18:13:01Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04031v1",
        "abs_url": "https://arxiv.org/abs/2512.04031v1",
        "categories": [
          "astro-ph.IM",
          "astro-ph.HE",
          "cs.AI"
        ],
        "primary_category": "astro-ph.IM"
      },
      {
        "id": "2512.04025v1",
        "title": "PSA: Pyramid Sparse Attention for Efficient Video Understanding and Generation",
        "authors": [
          "Xiaolong Li",
          "Youping Gu",
          "Xi Lin",
          "Weijie Wang",
          "Bohan Zhuang"
        ],
        "abstract": "Attention mechanisms are the core of foundation models, but their quadratic complexity remains a critical bottleneck for scaling. This challenge has driven the development of efficient attention mechanisms, with sparsity emerging as the dominant paradigm. Current methods typically retain or discard entire key-value blocks with binary masks, resulting in substantial information loss under high sparsity. To mitigate this gap, we present Pyramid Sparse Attention (PSA), a versatile module applicable...",
        "published": "2025-12-03T18:02:11Z",
        "updated": "2025-12-03T18:02:11Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04025v1",
        "abs_url": "https://arxiv.org/abs/2512.04025v1",
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2512.04016v1",
        "title": "TARA Test-by-Adaptive-Ranks for Quantum Anomaly Detection with Conformal Prediction Guarantees",
        "authors": [
          "Davut Emre Tasar",
          "Ceren Ocal Tasar"
        ],
        "abstract": "Quantum key distribution (QKD) security fundamentally relies on the ability to distinguish genuine quantum correlations from classical eavesdropper simulations, yet existing certification methods lack rigorous statistical guarantees under finite-sample conditions and adversarial scenarios. We introduce TARA (Test by Adaptive Ranks), a novel framework combining conformal prediction with sequential martingale testing for quantum anomaly detection that provides distribution-free validity guarantees...",
        "published": "2025-12-03T17:53:38Z",
        "updated": "2025-12-03T17:53:38Z",
        "pdf_url": "https://arxiv.org/pdf/2512.04016v1",
        "abs_url": "https://arxiv.org/abs/2512.04016v1",
        "categories": [
          "quant-ph",
          "cs.AI"
        ],
        "primary_category": "quant-ph"
      }
    ],
    "count": 15,
    "categories": [
      "cs.AI",
      "cs.LG",
      "cs.CL"
    ],
    "fetch_date": "2025-12-04"
  },
  "metadata": {
    "source": "arXiv API",
    "query": "cat:cs.AI OR cat:cs.LG OR cat:cs.CL",
    "deduplication": {
      "total_fetched": 15,
      "new_papers": 15,
      "duplicates_filtered": 0,
      "last_fetch": "2025-12-03T09:05:20.321173"
    }
  },
  "costs": {
    "execution_time": 0.9560515880584717,
    "execution_minutes": 0.015934193134307863,
    "github_actions": 0.0001274735450744629,
    "openai": {
      "input": 0,
      "output": 0,
      "total": 0
    },
    "total": 0.0001274735450744629,
    "token_usage": {}
  }
}