{
  "agent": "agent-a-paper-fetcher",
  "timestamp": "2025-11-18T09:03:16.108058",
  "status": "completed",
  "data": {
    "papers": [
      {
        "id": "2511.13719v1",
        "title": "Scaling Spatial Intelligence with Multimodal Foundation Models",
        "authors": [
          "Zhongang Cai",
          "Ruisi Wang",
          "Chenyang Gu",
          "Fanyi Pu",
          "Junxiang Xu"
        ],
        "abstract": "Despite remarkable progress, multimodal foundation models still exhibit surprising deficiencies in spatial intelligence. In this work, we explore scaling up multimodal foundation models to cultivate spatial intelligence within the SenseNova-SI family, built upon established multimodal foundations including visual understanding models (i.e., Qwen3-VL and InternVL3) and unified understanding and generation models (i.e., Bagel). We take a principled approach to constructing high-performing and robu...",
        "published": "2025-11-17T18:59:33Z",
        "updated": "2025-11-17T18:59:33Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13719v1",
        "abs_url": "https://arxiv.org/abs/2511.13719v1",
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG",
          "cs.MM",
          "cs.RO"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2511.13714v1",
        "title": "UnSAMv2: Self-Supervised Learning Enables Segment Anything at Any Granularity",
        "authors": [
          "Junwei Yu",
          "Trevor Darrell",
          "XuDong Wang"
        ],
        "abstract": "The Segment Anything Model (SAM) family has become a widely adopted vision foundation model, but its ability to control segmentation granularity remains limited. Users often need to refine results manually - by adding more prompts or selecting from pre-generated masks - to achieve the desired level of detail. This process can be ambiguous, as the same prompt may correspond to several plausible masks, and collecting dense annotations across all granularities is prohibitively expensive, making sup...",
        "published": "2025-11-17T18:58:34Z",
        "updated": "2025-11-17T18:58:34Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13714v1",
        "abs_url": "https://arxiv.org/abs/2511.13714v1",
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2511.13712v1",
        "title": "From Black Box to Insight: Explainable AI for Extreme Event Preparedness",
        "authors": [
          "Kiana Vu",
          "İsmet Selçuk Özer",
          "Phung Lai",
          "Zheng Wu",
          "Thilanka Munasinghe"
        ],
        "abstract": "As climate change accelerates the frequency and severity of extreme events such as wildfires, the need for accurate, explainable, and actionable forecasting becomes increasingly urgent. While artificial intelligence (AI) models have shown promise in predicting such events, their adoption in real-world decision-making remains limited due to their black-box nature, which limits trust, explainability, and operational readiness. This paper investigates the role of explainable AI (XAI) in bridging th...",
        "published": "2025-11-17T18:57:15Z",
        "updated": "2025-11-17T18:57:15Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13712v1",
        "abs_url": "https://arxiv.org/abs/2511.13712v1",
        "categories": [
          "cs.LG",
          "cs.AI"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.13710v1",
        "title": "From Power to Precision: Learning Fine-grained Dexterity for Multi-fingered Robotic Hands",
        "authors": [
          "Jianglong Ye",
          "Lai Wei",
          "Guangqi Jiang",
          "Changwei Jing",
          "Xueyan Zou"
        ],
        "abstract": "Human grasps can be roughly categorized into two types: power grasps and precision grasps. Precision grasping enables tool use and is believed to have influenced human evolution. Today's multi-fingered robotic hands are effective in power grasps, but for tasks requiring precision, parallel grippers are still more widely adopted. This contrast highlights a key limitation in current robotic hand design: the difficulty of achieving both stable power grasps and precise, fine-grained manipulation wit...",
        "published": "2025-11-17T18:56:50Z",
        "updated": "2025-11-17T18:56:50Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13710v1",
        "abs_url": "https://arxiv.org/abs/2511.13710v1",
        "categories": [
          "cs.RO",
          "cs.AI",
          "cs.LG"
        ],
        "primary_category": "cs.RO"
      },
      {
        "id": "2511.13705v1",
        "title": "Rare Genomic Subtype Discovery from RNA-seq via Autoencoder Embeddings and Stability-Aware Clustering",
        "authors": [
          "Alaa Mezghiche"
        ],
        "abstract": "Unsupervised learning on high-dimensional RNA-seq data can reveal molecular subtypes beyond standard labels. We combine an autoencoder-based representation with clustering and stability analysis to search for rare but reproducible genomic subtypes. On the UCI \"Gene Expression Cancer RNA-Seq\" dataset (801 samples, 20,531 genes; BRCA, COAD, KIRC, LUAD, PRAD), a pan-cancer analysis shows clusters aligning almost perfectly with tissue of origin (Cramer's V = 0.887), serving as a negative control. We...",
        "published": "2025-11-17T18:53:43Z",
        "updated": "2025-11-17T18:53:43Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13705v1",
        "abs_url": "https://arxiv.org/abs/2511.13705v1",
        "categories": [
          "cs.LG",
          "q-bio.GN"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.13703v1",
        "title": "Generalist Foundation Models Are Not Clinical Enough for Hospital Operations",
        "authors": [
          "Lavender Y. Jiang",
          "Angelica Chen",
          "Xu Han",
          "Xujin Chris Liu",
          "Radhika Dua"
        ],
        "abstract": "Hospitals and healthcare systems rely on operational decisions that determine patient flow, cost, and quality of care. Despite strong performance on medical knowledge and conversational benchmarks, foundation models trained on general text may lack the specialized knowledge required for these operational decisions. We introduce Lang1, a family of models (100M-7B parameters) pretrained on a specialized corpus blending 80B clinical tokens from NYU Langone Health's EHRs and 627B tokens from the int...",
        "published": "2025-11-17T18:52:22Z",
        "updated": "2025-11-17T18:52:22Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13703v1",
        "abs_url": "https://arxiv.org/abs/2511.13703v1",
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.LG"
        ],
        "primary_category": "cs.CL"
      },
      {
        "id": "2511.13702v1",
        "title": "ST-ProC: A Graph-Prototypical Framework for Robust Semi-Supervised Travel Mode Identification",
        "authors": [
          "Luyao Niu",
          "Nuoxian Huang"
        ],
        "abstract": "Travel mode identification (TMI) from GPS trajectories is critical for urban intelligence, but is hampered by the high cost of annotation, leading to severe label scarcity. Prevailing semi-supervised learning (SSL) methods are ill-suited for this task, as they suffer from catastrophic confirmation bias and ignore the intrinsic data manifold. We propose ST-ProC, a novel graph-prototypical multi-objective SSL framework to address these limitations. Our framework synergizes a graph-prototypical cor...",
        "published": "2025-11-17T18:52:11Z",
        "updated": "2025-11-17T18:52:11Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13702v1",
        "abs_url": "https://arxiv.org/abs/2511.13702v1",
        "categories": [
          "cs.LG",
          "cs.AI"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.13701v1",
        "title": "Learning stochasticity: a nonparametric framework for intrinsic noise estimation",
        "authors": [
          "Gianluigi Pillonetto",
          "Alberto Giaretta",
          "Mauro Bisiacco"
        ],
        "abstract": "Understanding the principles that govern dynamical systems is a central challenge across many scientific domains, including biology and ecology. Incomplete knowledge of nonlinear interactions and stochastic effects often renders bottom-up modeling approaches ineffective, motivating the development of methods that can discover governing equations directly from data. In such contexts, parametric models often struggle without strong prior knowledge, especially when estimating intrinsic noise. Nonet...",
        "published": "2025-11-17T18:52:05Z",
        "updated": "2025-11-17T18:52:05Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13701v1",
        "abs_url": "https://arxiv.org/abs/2511.13701v1",
        "categories": [
          "cs.LG"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.13699v1",
        "title": "Efficient Calibration for Decision Making",
        "authors": [
          "Parikshit Gopalan",
          "Konstantinos Stavropoulos",
          "Kunal Talwar",
          "Pranay Tankala"
        ],
        "abstract": "A decision-theoretic characterization of perfect calibration is that an agent seeking to minimize a proper loss in expectation cannot improve their outcome by post-processing a perfectly calibrated predictor. Hu and Wu (FOCS'24) use this to define an approximate calibration measure called calibration decision loss ($\\mathsf{CDL}$), which measures the maximal improvement achievable by any post-processing over any proper loss. Unfortunately, $\\mathsf{CDL}$ turns out to be intractable to even weakl...",
        "published": "2025-11-17T18:52:00Z",
        "updated": "2025-11-17T18:52:00Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13699v1",
        "abs_url": "https://arxiv.org/abs/2511.13699v1",
        "categories": [
          "cs.LG",
          "cs.DS",
          "stat.ML"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.13689v1",
        "title": "Crossing Borders: A Multimodal Challenge for Indian Poetry Translation and Image Generation",
        "authors": [
          "Sofia Jamil",
          "Kotla Sai Charan",
          "Sriparna Saha",
          "Koustava Goswami",
          "Joseph K J"
        ],
        "abstract": "Indian poetry, known for its linguistic complexity and deep cultural resonance, has a rich and varied heritage spanning thousands of years. However, its layered meanings, cultural allusions, and sophisticated grammatical constructions often pose challenges for comprehension, especially for non-native speakers or readers unfamiliar with its context and language. Despite its cultural significance, existing works on poetry have largely overlooked Indian language poems. In this paper, we propose the...",
        "published": "2025-11-17T18:41:16Z",
        "updated": "2025-11-17T18:41:16Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13689v1",
        "abs_url": "https://arxiv.org/abs/2511.13689v1",
        "categories": [
          "cs.CL",
          "cs.CV"
        ],
        "primary_category": "cs.CL"
      },
      {
        "id": "2511.13685v1",
        "title": "Protein Secondary Structure Prediction Using 3D Graphs and Relation-Aware Message Passing Transformers",
        "authors": [
          "Disha Varshney",
          "Samarth Garg",
          "Sarthak Tyagi",
          "Deeksha Varshney",
          "Nayan Deep"
        ],
        "abstract": "In this study, we tackle the challenging task of predicting secondary structures from protein primary sequences, a pivotal initial stride towards predicting tertiary structures, while yielding crucial insights into protein activity, relationships, and functions. Existing methods often utilize extensive sets of unlabeled amino acid sequences. However, these approaches neither explicitly capture nor harness the accessible protein 3D structural data, which is recognized as a decisive factor in dict...",
        "published": "2025-11-17T18:39:13Z",
        "updated": "2025-11-17T18:39:13Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13685v1",
        "abs_url": "https://arxiv.org/abs/2511.13685v1",
        "categories": [
          "cs.LG",
          "cs.AI"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.13684v1",
        "title": "Training-Free Multi-View Extension of IC-Light for Textual Position-Aware Scene Relighting",
        "authors": [
          "Jiangnan Ye",
          "Jiedong Zhuang",
          "Lianrui Mu",
          "Wenjie Zheng",
          "Jiaqi Hu"
        ],
        "abstract": "We introduce GS-Light, an efficient, textual position-aware pipeline for text-guided relighting of 3D scenes represented via Gaussian Splatting (3DGS). GS-Light implements a training-free extension of a single-input diffusion model to handle multi-view inputs. Given a user prompt that may specify lighting direction, color, intensity, or reference objects, we employ a large vision-language model (LVLM) to parse the prompt into lighting priors. Using off-the-shelf estimators for geometry and seman...",
        "published": "2025-11-17T18:37:41Z",
        "updated": "2025-11-17T18:37:41Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13684v1",
        "abs_url": "https://arxiv.org/abs/2511.13684v1",
        "categories": [
          "cs.CV",
          "cs.LG"
        ],
        "primary_category": "cs.CV"
      },
      {
        "id": "2511.13680v1",
        "title": "Cross-Learning from Scarce Data via Multi-Task Constrained Optimization",
        "authors": [
          "Leopoldo Agorio",
          "Juan Cerviño",
          "Miguel Calvo-Fullana",
          "Alejandro Ribeiro",
          "Juan Andrés Bazerque"
        ],
        "abstract": "A learning task, understood as the problem of fitting a parametric model from supervised data, fundamentally requires the dataset to be large enough to be representative of the underlying distribution of the source. When data is limited, the learned models fail generalize to cases not seen during training. This paper introduces a multi-task \\emph{cross-learning} framework to overcome data scarcity by jointly estimating \\emph{deterministic} parameters across multiple, related tasks. We formulate ...",
        "published": "2025-11-17T18:35:59Z",
        "updated": "2025-11-17T18:35:59Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13680v1",
        "abs_url": "https://arxiv.org/abs/2511.13680v1",
        "categories": [
          "cs.LG",
          "eess.SP"
        ],
        "primary_category": "cs.LG"
      },
      {
        "id": "2511.13679v1",
        "title": "QUILL: An Algorithm-Architecture Co-Design for Cache-Local Deformable Attention",
        "authors": [
          "Hyunwoo Oh",
          "Hanning Chen",
          "Sanggeon Yun",
          "Yang Ni",
          "Wenjun Huang"
        ],
        "abstract": "Deformable transformers deliver state-of-the-art detection but map poorly to hardware due to irregular memory access and low arithmetic intensity. We introduce QUILL, a schedule-aware accelerator that turns deformable attention into cache-friendly, single-pass work. At its core, Distance-based Out-of-Order Querying (DOOQ) orders queries by spatial proximity; the look-ahead drives a region prefetch into an alternate buffer--forming a schedule-aware prefetch loop that overlaps memory and compute. ...",
        "published": "2025-11-17T18:34:04Z",
        "updated": "2025-11-17T18:34:04Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13679v1",
        "abs_url": "https://arxiv.org/abs/2511.13679v1",
        "categories": [
          "cs.AR",
          "cs.CV",
          "cs.LG"
        ],
        "primary_category": "cs.AR"
      },
      {
        "id": "2511.13676v1",
        "title": "T-SAR: A Full-Stack Co-design for CPU-Only Ternary LLM Inference via In-Place SIMD ALU Reorganization",
        "authors": [
          "Hyunwoo Oh",
          "KyungIn Nam",
          "Rajat Bhattacharjya",
          "Hanning Chen",
          "Tamoghno Das"
        ],
        "abstract": "Recent advances in LLMs have outpaced the computational and memory capacities of edge platforms that primarily employ CPUs, thereby challenging efficient and scalable deployment. While ternary quantization enables significant resource savings, existing CPU solutions rely heavily on memory-based lookup tables (LUTs) which limit scalability, and FPGA or GPU accelerators remain impractical for edge use. This paper presents T-SAR, the first framework to achieve scalable ternary LLM inference on CPUs...",
        "published": "2025-11-17T18:32:03Z",
        "updated": "2025-11-17T18:32:03Z",
        "pdf_url": "https://arxiv.org/pdf/2511.13676v1",
        "abs_url": "https://arxiv.org/abs/2511.13676v1",
        "categories": [
          "cs.AR",
          "cs.LG"
        ],
        "primary_category": "cs.AR"
      }
    ],
    "count": 15,
    "categories": [
      "cs.AI",
      "cs.LG",
      "cs.CL"
    ],
    "fetch_date": "2025-11-18"
  },
  "metadata": {
    "source": "arXiv API",
    "query": "cat:cs.AI OR cat:cs.LG OR cat:cs.CL",
    "deduplication": {
      "total_fetched": 15,
      "new_papers": 15,
      "duplicates_filtered": 0,
      "last_fetch": "2025-11-17T09:04:15.982940"
    }
  },
  "costs": {
    "execution_time": 0.45351648330688477,
    "execution_minutes": 0.007558608055114746,
    "github_actions": 6.046886444091797e-05,
    "openai": {
      "input": 0,
      "output": 0,
      "total": 0
    },
    "total": 6.046886444091797e-05,
    "token_usage": {}
  }
}